//большее и меньшее число из массива
#include <stdio.h>

int main() {
	int arr[100];
	int n;
	scanf("%d", &n);
	for(int i; i < n; i = i + 1) { //i это индекс массива (0, 1, 2...)
		scanf("%d", &arr[i]); //ввод массива
	}
	int max = arr[0]; //max - большее число, изначально первый элемент массива это большее число (max = arr[0])
	for(int i = 1; i < n; i = i + 1) { //int i = 1 потому что начинаем искать max со второго элемента массива
		if(arr[i] > max) { //если элемент массива больше переменной max
			max = arr[i]; //max равно этому элементу массива
		}
	}
	int min = arr[0]; //min - меньшее число, изначально первый элемент массива это меньшее число (min = arr[0])
	for(int i = 1; i < n; i = i + 1) { //int i = 1 потому что начинаем искать min со второго элемента массива
		if(arr[i] < min) { //если элемент массива меньше переменной min
			min = arr[i]; //min равно этому элементу массива
		}
	}
	printf("max = ");
	printf("%d\n", max);
	printf("min = ");
	printf("%d\n", min);
	return 0;
}
