//сортирует массив по возрастанию
#include <stdio.h>

int main () {
	int a[100]; 
	int n; //количество элементов в массиве
	scanf("%d", &n); //пользователь вводит кол-во элементов в массиве
	for(int i = 0; i < n; i++) {
		scanf("%d", &a[i]); //scanf в цикле for чтобы внести данные в массив 
	}
	for(int i = 0; i < n - 1; i++) {
		for(int j = 0; j < n - 1 - i; j++) { //j количество пар в массиве
			if(a[j] > a[j + 1]) {  //берем каждую пару и поочереди их сравниваем, меньшее число влево, большее вправо. За 1 итерацию одно самое большое число уходит в конец массива
				int t = a[j + 1]; 
				a[j + 1] = a[j]; 
				a[j] = t; 
			}
		}
	}
	for(int i=0;i<n;i++){
		printf("%d", a[i]); //вывод массива
	}
	return 0;
}
